app/Controllers/Home.php

SELECT *
FROM `department`
---
    public function index()
    {
        $queryBuilder = $this->departmentModel->select("*")->get();

SELECT *
FROM `accounts`
WHERE `USERNAME` = 'admin'
AND `PASSWORD` = 'admin1'
---
    public function signIn()
    {
    if ($this->request->getMethod() == "post") {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $query = $this->accountsModel->where('USERNAME', $username)
                                      ->where('PASSWORD', $password)
                                      ->get();

SELECT *
FROM `accounts`
---
    public function register()
    {
        $queryAccount = $this->accountsModel->select("*")->get();

SELECT *
FROM `commcen`
---
    public function commcen()
    {
        $queryCommcen = $this->commcenModel->select("*")->get();