app/Controllers/User.php

SELECT *
FROM `department`
---
    public function cityOfficials()
    {
        $queryBuilder = $this->officialModel->query("SELECT o.ID as ID, o.NAME as 'NAME', o.ADDRESS as 'ADDRESS',
                            o.NUMBER as 'NUMBER', o.EMAIL_ADDRESS as EMAIL_ADDRESS, d.ID as DEPARTMENT_ID, d.NAME
                            as DEPARTMENT_NAME from official o INNER JOIN department d on d.ID = o.DEPARTMENT_ID");

        $queryDepartment = $this->departmentModel->select("*")->get();

SELECT *
FROM `admin`
---
    public function Admin()
    {
        $queryAdmin = $this->adminModel->select("*")->get();

SELECT *
FROM `commcen`
---
    public function Commcen()
    {
        $queryCommcen = $this->commcenModel->select("*")->get();

SELECT *
FROM `logistics`
---
    public function Logistics()
    {
        $queryLogistics = $this->logisticsModel->select("*")->get();